Revit 2024 API
PanelScheduleView.IsCellInPhaseLoads Method
 Check if this cell in the phase loads
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsCellInPhaseLoads(
	int nRow,
	int nCol
)
Visual Basic
Public Function IsCellInPhaseLoads ( _
	nRow As Integer, _
	nCol As Integer _
) As Boolean
Visual C++
public:
bool IsCellInPhaseLoads(
	int nRow,
	int nCol
)
Parameters
nRow
Type: System.Int32
 Row Number
nCol
Type: System.Int32
 Column Number
Return Value
 True if this cell in the phase loads, false otherwise
See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace